reports/p14-1/smoke/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /workspace/scripts/seckill_burst.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m15s max duration (incl. graceful stop):
              * burst: 10 iterations shared among 10 VUs (maxDuration: 45s, gracefulStop: 30s)


     ✓ business outcome classified

     business_accepted..............: 5       215.031798/s
     business_duration..............: avg=15.82ms  min=8.76ms   med=16ms     max=21.38ms  p(90)=21.36ms  p(95)=21.37ms  p(99)=21.38ms 
     business_out_of_stock..........: 5       215.031798/s
     business_rejected..............: 5       215.031798/s
     checks.........................: 100.00% 10 out of 10
     data_received..................: 1.7 kB  72 kB/s
     data_sent......................: 1.6 kB  68 kB/s
     http_req_blocked...............: avg=997.49µs min=774.79µs med=988.41µs max=1.25ms   p(90)=1.14ms   p(95)=1.19ms   p(99)=1.24ms  
     http_req_connecting............: avg=122.39µs min=44.16µs  med=100.68µs max=309.08µs p(90)=180.23µs p(95)=244.65µs p(99)=296.19µs
   ✓ http_req_duration..............: avg=15.82ms  min=8.76ms   med=16ms     max=21.38ms  p(90)=21.36ms  p(95)=21.37ms  p(99)=21.38ms 
       { expected_response:true }...: avg=15.82ms  min=8.76ms   med=16ms     max=21.38ms  p(90)=21.36ms  p(95)=21.37ms  p(99)=21.38ms 
   ✓ http_req_failed................: 0.00%   0 out of 10
     http_req_receiving.............: avg=662.72µs min=37.25µs  med=391.77µs max=2.12ms   p(90)=1.56ms   p(95)=1.84ms   p(99)=2.06ms  
     http_req_sending...............: avg=30.89µs  min=6.33µs   med=32.62µs  max=58.66µs  p(90)=49.17µs  p(95)=53.92µs  p(99)=57.71µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=15.12ms  min=8.01ms   med=15.24ms  max=21.3ms   p(90)=21.2ms   p(95)=21.25ms  p(99)=21.29ms 
     http_reqs......................: 10      430.063596/s
     iteration_duration.............: avg=17.6ms   min=12.12ms  med=17.38ms  max=22.86ms  p(90)=22.77ms  p(95)=22.81ms  p(99)=22.85ms 
     iterations.....................: 10      430.063596/s
   ✓ technical_errors...............: 0.00%   0 out of 10


running (0m00.0s), 00/10 VUs, 10 complete and 0 interrupted iterations
burst ✓ [ 100% ] 10 VUs  00.0s/45s  10/10 shared iters